#include "s21_decimal.h"

int s21_is_not_equal(s21_decimal value_1, s21_decimal value_2) {
  /*Функция s21_is_not_equal сравнивает два значения типа s21_decimal и
   * возвращает 1, если они не равны, или 0, если они равны.*/
  int error = 1;
  /*error используется для хранения кода ошибки.*/
  error = !(s21_is_equal(value_1, value_2));
  /*Функция s21_is_equal сравнивает значения value_1 и value_2 и возвращает 1,
  если они равны, или 0, если нет. Используется оператор ! (логическое НЕ) для
  инвертирования результата функции s21_is_equal*/
  return error;
  /*Возвращается значение error, которое будет 1, если значения не равны, или 0,
   * если они равны.*/
}