#include "s21_decimal.h"

int s21_from_decimal_to_float(s21_decimal src, float *dst) {
  /* Объявляется переменная temp типа double,
  и ей присваивается значение *dst, приведенное к типу double.
  Это делается для сохранения исходного значения *dst, которое предполагается
  изменить.*/
  double temp = (double)*dst;
  for (int i = 0; i < 96; i++) {
    /*На каждой итерации этой строки к переменной temp добавляется значение, \
    которое получается умножением значения бита,
    полученного из числа src с помощью функции get_bit, на степень двойки 2 в
    степени i. Это действие выполняет преобразование числа в двоичной системе в
    десятичное.*/
    temp += get_bit(src, i) * pow(2, i);
  }
  /*После завершения цикла, переменная temp умножается на 10 в степени
  -get_scale(src). Это действие корректирует значение temp в соответствии с
  масштабом числа.*/
  temp = temp * pow(10, -get_scale(src));
  /*Если установлен 127-й бит числа src, что может указывать на отрицательное
  число, то значение temp умножается на -1, что делает его отрицательным.*/
  if (get_bit(src, 127)) temp = temp * (-1);
  *dst = temp;
  return 0;
}