#include "s21_decimal.h"

int s21_from_float_to_decimal(float src, s21_decimal *dst) {
  nulling(dst);
  int return_value = 0;
  /*Проверяется, является ли src бесконечностью или не числом (NaN).
   Если это так, то устанавливается флаг ошибки.*/
  if (isinf(src) || isnan(src)) {
    return_value = 1;
  } else {
    /*Проверяется, отличается ли src от нуля.
    Если это так, то выполняется преобразование.*/
    if (src != 0) {
      /*Извлекается знак числа src.
       Это делается путем приведения указателя на src к типу int и сдвига на 31
       бит вправо.*/
      int sign = *(int *)&src >> 31;
      /*Извлекается экспонента числа src.
       Это делается путем снятия знака и сдвига на 23 бита вправо, а затем
       вычитанием 127.*/
      int exp = ((*(int *)&src & ~0x80000000) >> 23) - 127;
      /*Получается абсолютное значение числа src и приводится к типу double*/
      double temp = (double)fabs(src);
      int off = 0;
      /*В этом цикле проверяется, находится ли десятичная точка в правильном
      положении. Если да, то значение temp умножается на 10, а переменная off
      увеличивается на 1.*/
      for (; off < 28 && (int)temp / (int)pow(2, 21) == 0; temp *= 10, off++) {
      }
      /*Значение temp округляется до ближайшего целого числа.*/
      temp = round(temp);
      /*Проверяется, находится ли десятичная точка в допустимом диапазоне
      и соответствует ли экспонента допустимому диапазону для структуры
      s21_decimal*/
      if (off <= 28 && (exp > -94 && exp < 96)) {
        /*Объявляется структура floatbits и инициализируется нулевыми
        значениями. Она будет использоваться для извлечения мантиссы числа
        temp*/
        floatbits mant = {0};
        temp = (float)temp;
        /*В этом цикле проверяется, оканчивается ли temp на ноль, и если да,
        то значение temp делится на 10, а переменная off уменьшается на 1.*/
        for (; fmod(temp, 10) == 0 && off > 0; off--, temp /= 10) {
        }
        mant.fl = temp;
        /*Извлекается экспонента из мантиссы числа temp.*/
        exp = ((*(int *)&mant.fl & ~0x80000000) >> 23) - 127;
        /*Устанавливается соответствующий бит в массиве bits структуры dst для
         * экспоненты.*/
        dst->bits[exp / 32] |= 1 << exp % 32;
        /*Начинается цикл для установки битов мантиссы в массиве bits*/
        for (int i = exp - 1, j = 22; j >= 0; i--, j--)
          /*Если бит мантиссы установлен,
          то устанавливается соответствующий бит в массиве bits структуры dst*/
          if ((mant.ui & (1 << j)) != 0) dst->bits[i / 32] |= 1 << i % 32;
        /*Значение знака и сдвига десятичной точки сохраняется в соответствующем
         * поле массива */
        dst->bits[3] = (sign << 31) | (off << 16);
      }
    }
  }
  return return_value;
}
